sterentev/atdf-device-asm-include/inc/ATmega32C1.inc
; ----------	Register CANGSTA bits		------------------------
.equ	OVFG		= 6		; 0x40 - Overload Frame Flag
.equ	TXBSY		= 4		; 0x10 - Transmitter Busy
.equ	RXBSY		= 3		; 0x08 - Receiver Busy
.equ	ENFG		= 2		; 0x04 - Enable Flag
.equ	BOFF		= 1		; 0x02 - Bus Off Mode
.equ	ERRP		= 0		; 0x01 - Error Passive Mode

; ----------	Register CANGIT bits		------------------------
.equ	CANIT		= 7		; 0x80 - General Interrupt Flag
.equ	BOFFIT		= 6		; 0x40 - Bus Off Interrupt Flag
.equ	OVRTIM		= 5		; 0x20 - Overrun CAN Timer Flag
.equ	BXOK		= 4		; 0x10 - Burst Receive Interrupt Flag
.equ	SERG		= 3		; 0x08 - Stuff Error General Flag
.equ	CERG		= 2		; 0x04 - CRC Error General Flag
.equ	FERG		= 1		; 0x02 - Form Error General Flag
.equ	AERG		= 0		; 0x01 - Acknowledgement Error General Flag

; ----------	Register CANGIE bits		------------------------
.equ	ENIT		= 7		; 0x80 - Enable all Interrupts
.equ	ENBOFF		= 6		; 0x40 - Enable Bus Off Interrupt
.equ	ENRX		= 5		; 0x20 - Enable Receive Interrupt
.equ	ENTX		= 4		; 0x10 - Enable Transmit Interrupt
.equ	ENERR		= 3		; 0x08 - Enable MOb Error Interrupt
.equ	ENBX		= 2		; 0x04 - Enable Burst Receive Interrupt
.equ	ENERG		= 1		; 0x02 - Enable General Error Interrupt
.equ	ENOVRT		= 0		; 0x01 - Enable CAN Timer Overrun Interrupt

; ----------	Register CANEN2 bits		------------------------
.equ	ENMOB_MASK	= 0x3F		;      - Enable MObs (6 bits)
.equ	ENMOB0		= 0		;          ENMOB BIT0 position

; ----------	Register CANIE2 bits		------------------------
.equ	IEMOB_MASK	= 0x3F		;      - Interrupt Enable  MObs (6 bits)
.equ	IEMOB0		= 0		;          IEMOB BIT0 position

; ----------	Register CANSIT2 bits		------------------------
.equ	SIT_MASK	= 0x3F		;      - Status of Interrupt MObs (6 bits)
.equ	SIT0		= 0		;          SIT BIT0 position

; ----------	Register CANBT1 bits		------------------------
.equ	BRP_MASK	= 0x7E		;      - Baud Rate Prescaler bits (6 bits)
.equ	BRP0		= 1		;          BRP BIT0 position

; ----------	Register CANBT2 bits		------------------------
.equ	SJW_MASK	= 0x60		;      - Re-Sync Jump Width bits (2 bits)
.equ	SJW0		= 5		;          SJW BIT0 position
.equ	PRS_MASK	= 0x0E		;      - Propagation Time Segment bits (3 bits)
.equ	PRS0		= 1		;          PRS BIT0 position

; ----------	Register CANBT3 bits		------------------------
.equ	PHS2_MASK	= 0x70		;      - Phase Segment 2 bits (3 bits)
.equ	PHS20		= 4		;          PHS2 BIT0 position
.equ	PHS1_MASK	= 0x0E		;      - Phase Segment 1 bits (3 bits)
.equ	PHS10		= 1		;          PHS1 BIT0 position
.equ	SMP		= 0		; 0x01 - Sample Type

; ----------	Register CANTCON bits		------------------------
.equ	TPRSC_MASK	= 0xFF		;      - Timer Control bits (8 bits)
.equ	TPRSC0		= 0		;          TPRSC BIT0 position

; ----------	Register CANTIM bits		------------------------
.equ	CANTIM_MASK	= 0xFFFF	;      - CAN Timer bits (16 bits)
.equ	CANTIM0		= 0		;          CANTIM BIT0 position

; ----------	Register CANTTC bits		------------------------
.equ	TIMTTC_MASK	= 0xFFFF	;      - TTC Timer Count (16 bits)
.equ	TIMTTC0		= 0		;          TIMTTC BIT0 position

; ----------	Register CANTEC bits		------------------------
.equ	TEC_MASK	= 0xFF		;      - Transmit Error Counter bits (8 bits)
.equ	TEC0		= 0		;          TEC BIT0 position

; ----------	Register CANREC bits		------------------------
.equ	REC_MASK	= 0xFF		;      - Receive Error Counter bits (8 bits)
.equ	REC0		= 0		;          REC BIT0 position

; ----------	Register CANHPMOB bits		------------------------
.equ	HPMOB_MASK	= 0xF0		;      - Highest Priority MOb Number bits (4 bits)
.equ	HPMOB0		= 4		;          HPMOB BIT0 position
.equ	CGP_MASK	= 0x0F		;      - CAN General Purpose bits (4 bits)
.equ	CGP0		= 0		;          CGP BIT0 position

; ----------	Register CANPAGE bits		------------------------
.equ	MOBNB_MASK	= 0xF0		;      - MOb Number bits (4 bits)
.equ	MOBNB0		= 4		;          MOBNB BIT0 position
.equ	AINC		= 3		; 0x08 - MOb Data Buffer Auto Increment (Active Low)
.equ	INDX_MASK	= 0x07		;      - Data Buffer Index bits (3 bits)
.equ	INDX0		= 0		;          INDX BIT0 position

; ----------	Register CANSTMOB bits		------------------------
.equ	DLCW		= 7		; 0x80 - Data Length Code Warning on MOb
.equ	TXOK		= 6		; 0x40 - Transmit OK on MOb
.equ	RXOK		= 5		; 0x20 - Receive OK on MOb
.equ	BERR		= 4		; 0x10 - Bit Error on MOb
.equ	SERR		= 3		; 0x08 - Stuff Error on MOb
.equ	CERR		= 2		; 0x04 - CRC Error on MOb
.equ	FERR		= 1		; 0x02 - Form Error on MOb
.equ	AERR		= 0		; 0x01 - Acknowledgement Error on MOb

; ----------	Register CANCDMOB bits		------------------------
.equ	CONMOB_MASK	= 0xC0		;      - MOb Config bits (2 bits)
.equ	CONMOB0		= 6		;          CONMOB BIT0 position
.equ	RPLV		= 5		; 0x20 - Reply Valid
.equ	IDE		= 4		; 0x10 - Identifier Extension
.equ	DLC_MASK	= 0x0F		;      - Data Length Code bits (4 bits)
.equ	DLC0		= 0		;          DLC BIT0 position

; ----------	Register CANIDT4 bits		------------------------
.equ	CANIDT4_IDT_MASK= 0xF8		;      - Identifier Tag (5 bits)
.equ	CANIDT4_IDT0	= 3		;          CANIDT4_IDT BIT0 position
.equ	RTRTAG		= 2		; 0x04 - Remote Transmission Request Tag
.equ	RB1TAG		= 1		; 0x02 - Reserved Bit 1 Tag
.equ	RB0TAG		= 0		; 0x01 - Reserved Bit 0 Tag

; ----------	Register CANIDT3 bits		------------------------
.equ	CANIDT3_IDT_MASK= 0xFF		;      - Identifier Tag (8 bits)
.equ	CANIDT3_IDT0	= 0		;          CANIDT3_IDT BIT0 position

; ----------	Register CANIDT2 bits		------------------------
.equ	CANIDT2_IDT_MASK= 0xFF		;      - Identifier Tag (8 bits)
.equ	CANIDT2_IDT0	= 0		;          CANIDT2_IDT BIT0 position

; ----------	Register CANIDT1 bits		------------------------
.equ	CANIDT1_IDT_MASK= 0xFF		;      - Identifier Tag (8 bits)
.equ	CANIDT1_IDT0	= 0		;          CANIDT1_IDT BIT0 position

; ----------	Register CANIDM4 bits		------------------------
.equ	IDEMSK		= 0		; 0x01 - Identifier Extension Mask
.equ	RTRMSK		= 2		; 0x04 - Remote Transmission Request Mask
.equ	CANIDM4_IDMSK_MASK= 0xF8		;      - Identifier Mask (5 bits)
.equ	CANIDM4_IDMSK0	= 3		;          CANIDM4_IDMSK BIT0 position

; ----------	Register CANIDM3 bits		------------------------
.equ	CANIDM3_IDMSK_MASK= 0xFF		;      - Identifier Mask (8 bits)
.equ	CANIDM3_IDMSK0	= 0		;          CANIDM3_IDMSK BIT0 position

; ----------	Register CANIDM2 bits		------------------------
.equ	CANIDM2_IDMSK_MASK= 0xFF		;      - Identifier Mask (8 bits)
.equ	CANIDM2_IDMSK0	= 0		;          CANIDM2_IDMSK BIT0 position

