sterentev/atdf-device-asm-include/inc/ATmega32C1.inc
; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 31
.equ	INT_VECTORS_SIZE	= 0x3E
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset
;	1	ANACOMP0	; Analog Comparator 0
;	2	ANACOMP1	; Analog Comparator 1
;	3	ANACOMP2	; Analog Comparator 2
;	4	ANACOMP3	; Analog Comparator 3
;	5	PSC_FAULT	; PSC Fault
;	6	PSC_EC		; PSC End of Cycle
;	7	INT0		; External Interrupt Request 0
;	8	INT1		; External Interrupt Request 1
;	9	INT2		; External Interrupt Request 2
;	10	INT3		; External Interrupt Request 3
;	11	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	12	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	13	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	14	TIMER1_OVF	; Timer1/Counter1 Overflow
;	15	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	16	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	17	TIMER0_OVF	; Timer/Counter0 Overflow
;	18	CAN_INT		; CAN MOB, Burst, General Errors
;	19	CAN_TOVF	; CAN Timer Overflow
;	20	LIN_TC		; LIN Transfer Complete
;	21	LIN_ERR		; LIN Error
;	22	PCINT0		; Pin Change Interrupt Request 0
;	23	PCINT1		; Pin Change Interrupt Request 1
;	24	PCINT2		; Pin Change Interrupt Request 2
;	25	PCINT3		; Pin Change Interrupt Request 3
;	26	SPI_STC		; SPI Serial Transfer Complete
;	27	ADC		; ADC Conversion Complete
;	28	WDT		; Watchdog Time-Out Interrupt
;	29	EE_READY	; EEPROM Ready
;	30	SPM_READY	; Store Program Memory Read


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset
;#		reti			; ANACOMP0	 - Analog Comparator 0
;#		reti			; ANACOMP1	 - Analog Comparator 1
;#		reti			; ANACOMP2	 - Analog Comparator 2
;#		reti			; ANACOMP3	 - Analog Comparator 3
;#		reti			; PSC_FAULT	 - PSC Fault
;#		reti			; PSC_EC	 - PSC End of Cycle
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer1/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; CAN_INT	 - CAN MOB, Burst, General Errors
;#		reti			; CAN_TOVF	 - CAN Timer Overflow
;#		reti			; LIN_TC	 - LIN Transfer Complete
;#		reti			; LIN_ERR	 - LIN Error
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; PCINT3	 - Pin Change Interrupt Request 3
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; ADC		 - ADC Conversion Complete
;#		reti			; WDT		 - Watchdog Time-Out Interrupt
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; SPM_READY	 - Store Program Memory Read
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA32C1_INC_ */

; ************************ END OF FILE *********************************

